// setTimeout ფუნქცია იყენებს callback-ს, დაწერეთ მისი promise-ზე დადაფუძნებული
// ალტერნატივა  (მაგ: mySetTimeout(delay).then(...)

// ● გამოიყენე პირველ დავალებაში შექმნილი ფუნქცია, რათა განავრცო ჩვენს მიერ
// დაწერილი “Toy Shop” შემდეგი პირობის იმპლემენტაციით:
// ➔ სათამაშოს დამზადებას სჭირდება დაახლოებით 3 წამი. (დროის მითითება
// შესაძლებელი უნდა იყოს დინამიურად)
// ➔ დავამატოთ კიდევ ერთი ნაბიჯი, რომელსაც დავარქმევთ პირობითად, “deliverToys”,
// რომლის დაყოვნებაც 2 წამია (გადაეცემა დინამიურად)
// ➔ სათამაშოს გაყიდვას სჭირდება 1 წამი (დინამიურად)
// ● ყოველი მომდევნო ნაბიჯი უნდა ელოდებოდეს წინა ნაბიჯის რეზულტატს და
// შესაბამისად წყვეტდეს მოხდება თუ არა მისი შესრულება
// ● გამოიყენე .then().catch() და async/await
// ● სინტაქსები. (2 ვარიანტი)
